---
kind: property
id: P:Autodesk.Revit.DB.Document.IsValidObject
zh: 文档、文件
source: html/41477e88-aa81-4648-aa8b-8f2d482d4705.htm
---
# Autodesk.Revit.DB.Document.IsValidObject Property

**中文**: 文档、文件

Specifies whether the .NET object represents a valid Revit entity.

## Syntax (C#)
```csharp
public bool IsValidObject { get; }
```

## Returns
True if the API object holds a valid Revit native object, false otherwise.

## Remarks
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
 a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.